app/serializers/content_serializer.rb

SELECT "genres".* FROM "genres" INNER JOIN "contents_genres" ON "genres"."id" = "contents_genres"."genre_id" WHERE "contents_genres"."content_id" = $1  [["content_id", 1]]
---
  def genre
    object.genres.map(&:genre_name).join(', ')

SELECT "countries".* FROM "countries" INNER JOIN "contents_countries" ON "countries"."id" = "contents_countries"."country_id" WHERE "contents_countries"."content_id" = $1  [["content_id", 1]]
---
  def country
    object.countries.map(&:country_name).join(', ')