desafio_api/app/controllers/api/v1/contents_controller.rb

      def index
        @contents = apply_scopes(Content.order(year: :desc)).all
---
SELECT "contents".* FROM "contents" ORDER BY "contents"."year" DESC